mcu598/6-AXIS-CH32V307-GRBL/__history/2023224222043_ch32v30x_usbhs_device.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : ch32v30x_usbhs_device.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2021/06/06
 * Description        : USB高速操作相关文件
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * SPDX-License-Identifier: Apache-2.0
 *******************************************************************************/
#include "ch32v30x_usbhs_device.h"

/******************************************************************************/
/* 常、变量定义 */

/* 函数声明 */
void USBHS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));

/* USB缓冲区定义 */
__attribute__ ((aligned(4))) UINT8
EP0_Databuf[USBHS_UEP0_SIZE]; /* 端点0数据收发缓冲区 */
__attribute__ ((aligned(4))) UINT8
EP1_Rx_Databuf[USBHS_MAX_PACK_SIZE]; /* 端点1数据接收缓冲区 */
__attribute__ ((aligned(4))) UINT8
EP1_Tx_Databuf[USBHS_MAX_PACK_SIZE]; /* 端点1数据发送缓冲区 */
__attribute__ ((aligned(4))) UINT8
EP2_Rx_Databuf[USBHS_MAX_PACK_SIZE]; /* 端点2数据接收缓冲区 */
__attribute__ ((aligned(4))) UINT8
EP2_Tx_Databuf[USBHS_MAX_PACK_SIZE]; /* 端点2数据发送缓冲区 */

#define pMySetupReqPak        ((PUSB_SETUP_REQ)EP0_Databuf)
const UINT8 *pDescr;
volatile UINT8 USBHS_Dev_SetupReqCode = 0xFF; /* USB2.0高速设备Setup包命令码 */
volatile UINT16 USBHS_Dev_SetupReqLen = 0x00; /* USB2.0高速设备Setup包长度 */
volatile UINT8 USBHS_Dev_SetupReqValueH =
  0x00; /* USB2.0高速设备Setup包Value高字节 */
volatile UINT8 USBHS_Dev_Config = 0x00; /* USB2.0高速设备配置值 */
volatile UINT8 USBHS_Dev_Address = 0x00; /* USB2.0高速设备地址值 */
volatile UINT8 USBHS_Dev_SleepStatus = 0x00; /* USB2.0高速设备睡眠状态 */
volatile UINT8 USBHS_Dev_EnumStatus = 0x00; /* USB2.0高速设备枚举状态 */
volatile UINT8 USBHS_Dev_Endp0_Tog = 0x01; /* USB2.0高速设备端点0同步标志 */
volatile UINT8 USBHS_Dev_Speed = 0x01; /* USB2.0高速设备速度 */
volatile UINT8 USBHS_Int_Flag = 0x00; /* USB2.0高速设备中断标志 */

volatile UINT16 USBHS_Endp1_Up_Flag =
  0x00; /* USB2.0高速设备端点1数据上传状态: 0:空闲; 1:正在上传; */
volatile UINT8 USBHS_Endp1_Down_Flag =
  0x00; /* USB2.0高速设备端点1下传成功标志 */
volatile UINT8 USBHS_Endp1_Down_Len = 0x00; /* USB2.0高速设备端点1下传长度 */
volatile UINT8 USBHS_Endp1_T_Tog = 0x00;
volatile UINT8 USBHS_Endp1_R_Tog = 0x00;

volatile UINT16 USBHS_Endp2_Up_Flag =
  0x00; /* USB2.0高速设备端点2数据上传状态: 0:空闲; 1:正在上传; */
volatile UINT16 USBHS_Endp2_Up_LoadPtr =
  0x00; /* USB2.0高速设备端点2数据上传装载偏移 */
volatile UINT8 USBHS_Endp2_Down_Flag =
  0x00; /* USB2.0高速设备端点2下传成功标志 */

/******************************************************************************/
/* USB设备描述符 */
UINT8 MyDevDescr[18] = { 0x12, 0x01, 0x00, 0x02, 0xFF, 0x00, 0x00, 0x40, 0x28,
                         0x0d, 0x04, 0x02, 0x00, 0x01, 0x01, 0x02, 0x03, 0x01
                       };

/* USB配置描述符(全速) */
const UINT8 MyCfgDescr_FS[] = { 0x09, 0x02, 0x2E, 0x00, 0x01, 0x01, 0x00, 0x80,
                                0x32, 0x09, 0x04, 0x00, 0x00, 0x04, 0xFF, 0x00, 0x00, 0x04, 0x07, 0x05,
                                0x01, 0x02, (UINT8) DEF_USB_FS_EP_SIZE, (UINT8) ( DEF_USB_FS_EP_SIZE
                                    >> 8), 0x00, 0x07, 0x05, 0x81, 0x02, (UINT8) DEF_USB_FS_EP_SIZE,
                                (UINT8) ( DEF_USB_FS_EP_SIZE >> 8), 0x00, 0x07, 0x05, 0x82, 0x02,
                                (UINT8) DEF_USB_FS_EP_SIZE, (UINT8) ( DEF_USB_FS_EP_SIZE >> 8), 0x00,
                                0x07, 0x05, 0x02, 0x02, (UINT8) DEF_USB_FS_EP_SIZE,
                                (UINT8) ( DEF_USB_FS_EP_SIZE >> 8), 0x00,
                              };

/* USB配置描述符(高速) */
const UINT8 MyCfgDescr_HS[] = { 0x09, 0x02, 0x2E, 0x00, 0x01, 0x01, 0x00, 0x80,
                                0x32, 0x09, 0x04, 0x00, 0x00, 0x04, 0xFF, 0x00, 0x00, 0x04, 0x07, 0x05,
                                0x01, 0x02, (UINT8) DEF_USB_HS_EP_SIZE, (UINT8) ( DEF_USB_HS_EP_SIZE
                                    >> 8), 0x00, 0x07, 0x05, 0x81, 0x02, (UINT8) DEF_USB_HS_EP_SIZE,
                                (UINT8) ( DEF_USB_HS_EP_SIZE >> 8), 0x00, 0x07, 0x05, 0x82, 0x02,
                                (UINT8) DEF_USB_HS_EP_SIZE, (UINT8) ( DEF_USB_HS_EP_SIZE >> 8), 0x00,
                                0x07, 0x05, 0x02, 0x02, (UINT8) DEF_USB_HS_EP_SIZE,
                                (UINT8) ( DEF_USB_HS_EP_SIZE >> 8), 0x00,
                              };

/* USB语言字符串描述符 */
const UINT8 MyLangDescr[] = { 0x04, 0x03, 0x09, 0x04 };

/* USB产商字符串描述符 */
const UINT8 MyManuInfo[] = { 6, 0x03, 'Z', 0x00, 'F', 0x00};

/* USB产品字符串描述符 */
const UINT8 MyProdInfo[] = { 26, 0x03, 'Z', 0x00, 'F', 0x00,  ' ', 0x00, 'C', 0x00, 'M', 0x00,
                             'S', 0x00, 'I', 0x00, 'S', 0x00, '-', 0x00, 'D', 0x00, 'A', 0x00, 'P',
                             0x00
                           };

/* USB序列号字符串描述符 */
const UINT8 MySerNumInfo[] = { 18, 0x03, '2', 0x00, '0', 0x00, '2', 0x00, '2',
                               0x00, '0', 0x00, '5', 0x00, '2', 0x00, '7', 0x00
                             };

const UINT8 MyInterfInfo[] = { 20, 0x03, 'C', 0x00, 'M', 0x00, 'S', 0x00, 'I',
                               0x00, 'S', 0x00, '-', 0x00, 'D', 0x00, 'A', 0x00, 'P', 0x00
                             };

/* USB设备限定描述符 */
const UINT8 MyUSBQUADesc[] = { 0x0A, 0x06, 0x00, 0x02, 0xFF, 0x00, 0x00, 0x40,
                               0x01, 0x00,
                             };

const UINT8 MyBOSDesc[] = { 0x05, 0x0f, 0x16, 0x00, 0x02, 0x07, 0x10, 0x02,
                            0x02, 0x00, 0x00, 0x00, 0x0a, 0x10, 0x03, 0x00, 0x0e, 0x00, 0x01, 0x0a,
                            0xff, 0x07,
                          };
/* USB全速模式,其他速度配置描述符 */
UINT8 TAB_USB_FS_OSC_DESC[sizeof(MyCfgDescr_HS)] = { 0x09, 0x07, /* 其他部分通过程序复制 */
                                                   };

/* USB高速模式,其他速度配置描述符 */
UINT8 TAB_USB_HS_OSC_DESC[sizeof(MyCfgDescr_FS)] = { 0x09, 0x07, /* 其他部分通过程序复制 */
                                                   };

#define WCID_VENDOR_CODE 0x17

#define WCID_STRING_DESCRIPTOR_MSOS_SIZE          (18)
UINT8 WCID_StringDescriptor_MSOS[18] =
{
  0x12, /* bLength */
  0x03, /* bDescriptorType */
  /* MSFT100 */
  'M', 0x00, 'S', 0x00, 'F', 0x00, 'T', 0x00, /* wcChar_7 */
  '1', 0x00, '0', 0x00, '0', 0x00, /* wcChar_7 */
  WCID_VENDOR_CODE, /* bVendorCode */
  0x00, /* bReserved */
};

uint8_t WCIDDescriptor[40] =
{
  0x28, 0x00, 0x00, 0x00, /* dwLength */
  0x00, 0x01, /* bcdVersion */
  0x04, 0x00, /* wIndex */
  0x01, /* bCount */
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* bReserved_7 */

