mcu598/6-AXIS-CH32V307-GRBL/__history/2023224222043_ch32v30x_usbhs_device.c
  ///////////////////////////////////////
  /// WCID function descriptor
  ///////////////////////////////////////
  0x00, /* bFirstInterfaceNumber */
  0x01, /* bReserved */
  /* WINUSB */
  'W', 'I', 'N', 'U', 'S', 'B', 0x00, 0x00, /* cCID_8 */
  /*  */
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* cSubCID_8 */
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, /* bReserved_6 */
};

uint8_t WCIDProperties[142] =
{
  0x8e, 0x00, 0x00, 0x00, /* dwLength */
  0x00, 0x01, /* bcdVersion */
  0x05, 0x00, /* wIndex */
  0x01, 0x00, /* wCount */

  ///////////////////////////////////////
  /// registry propter descriptor
  ///////////////////////////////////////
  0x84, 0x00, 0x00, 0x00, /* dwSize */
  0x01, 0x00, 0x00, 0x00, /* dwPropertyDataType */
  0x28, 0x00, /* wPropertyNameLength */
  /* DeviceInterfaceGUID */
  'D', 0x00, 'e', 0x00, 'v', 0x00, 'i', 0x00, /* wcName_20 */
  'c', 0x00, 'e', 0x00, 'I', 0x00, 'n', 0x00, /* wcName_20 */
  't', 0x00, 'e', 0x00, 'r', 0x00, 'f', 0x00, /* wcName_20 */
  'a', 0x00, 'c', 0x00, 'e', 0x00, 'G', 0x00, /* wcName_20 */
  'U', 0x00, 'I', 0x00, 'D', 0x00, 0x00, 0x00, /* wcName_20 */
  0x4e, 0x00, 0x00, 0x00, /* dwPropertyDataLength */
  /* {CDB3B5AD-293B-4663-AA36-1AAE46463776} */
  '{', 0x00, 'C', 0x00, 'D', 0x00, 'B', 0x00, /* wcData_39 */
  '3', 0x00, 'B', 0x00, '5', 0x00, 'A', 0x00, /* wcData_39 */
  'D', 0x00, '-', 0x00, '2', 0x00, '9', 0x00, /* wcData_39 */
  '3', 0x00, 'B', 0x00, '-', 0x00, '4', 0x00, /* wcData_39 */
  '6', 0x00, '6', 0x00, '3', 0x00, '-', 0x00, /* wcData_39 */
  'A', 0x00, 'A', 0x00, '3', 0x00, '6', 0x00, /* wcData_39 */
  '-', 0x00, '1', 0x00, 'A', 0x00, 'A', 0x00, /* wcData_39 */
  'E', 0x00, '4', 0x00, '6', 0x00, '4', 0x00, /* wcData_39 */
  '6', 0x00, '3', 0x00, '7', 0x00, '7', 0x00, /* wcData_39 */
  '6', 0x00, '}', 0x00, 0x00, 0x00, /* wcData_39 */
};

/*********************************************************************
 * @fn      USBHS_RCC_Init
 *
 * @brief   Initializes the clock for USB2.0 High speed device.
 *
 * @return  none
 */
void USBHS_RCC_Init(void)
{
  RCC->CFGR2 =
    USBHS_PLL_SRC_HSE | USBHS_PLL_SRC_PRE_DIV2 |
    USBHS_PLL_CKREF_4M; /* PLL REF = HSE/2 = 4MHz */
  RCC->CFGR2 |= USB_48M_CLK_SRC_PHY | USBHS_PLL_ALIVE;
  RCC->AHBPCENR |= ((uint32_t) (1 << 11));
  Delay_Us(200);
}

/*********************************************************************
 * @fn      USBHS_Device_Endp_Init
 *
 * @brief   USB2.0高速设备端点初始化
 *
 * @return  none
 */
void USBHS_Device_Endp_Init(void)
{
  /* 使能端点1、端点2发送和接收  */
  USBHSD->ENDP_CONFIG =
    USBHS_EP0_T_EN | USBHS_EP0_R_EN |
    USBHS_EP1_T_EN | USBHS_EP1_R_EN |
    USBHS_EP2_T_EN | USBHS_EP2_R_EN;

  /* 端点非同步端点 */
  USBHSD->ENDP_TYPE = 0x00;

  /* 端点缓冲区模式，非双缓冲区，ISO传输BUF模式需要指定0  */
  USBHSD->BUF_MODE = 0x00;

  /* 端点最大长度包配置 */
  USBHSD->UEP0_MAX_LEN = 64;
  USBHSD->UEP1_MAX_LEN = 1024;
  USBHSD->UEP2_MAX_LEN = 1024;
  USBHSD->UEP3_MAX_LEN = 512;
  USBHSD->UEP4_MAX_LEN = 512;
  USBHSD->UEP5_MAX_LEN = 512;
  USBHSD->UEP6_MAX_LEN = 512;
  USBHSD->UEP7_MAX_LEN = 512;
  USBHSD->UEP8_MAX_LEN = 512;
  USBHSD->UEP9_MAX_LEN = 512;
  USBHSD->UEP10_MAX_LEN = 512;
  USBHSD->UEP11_MAX_LEN = 512;
  USBHSD->UEP12_MAX_LEN = 512;
  USBHSD->UEP13_MAX_LEN = 512;
  USBHSD->UEP14_MAX_LEN = 512;
  USBHSD->UEP15_MAX_LEN = 512;

  /* 端点DMA地址配置 */
  USBHSD->UEP0_DMA = (UINT32) (UINT8 *) EP0_Databuf;
  USBHSD->UEP1_TX_DMA = (UINT32) (UINT8 *) EP1_Tx_Databuf;
  USBHSD->UEP1_RX_DMA = (UINT32) (UINT8 *) EP1_Rx_Databuf;
  USBHSD->UEP2_TX_DMA = (UINT32) (UINT8 *) EP2_Tx_Databuf;
  USBHSD->UEP2_RX_DMA = (UINT32) (UINT8 *) EP2_Rx_Databuf;

  /* 端点控制寄存器配置 */
  USBHSD->UEP0_TX_LEN = 0;
  USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_NAK;
  USBHSD->UEP0_RX_CTRL = USBHS_EP_R_RES_ACK;

  USBHSD->UEP1_TX_LEN = 0;
  USBHSD->UEP1_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP1_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP2_TX_LEN = 0;
  USBHSD->UEP2_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP2_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP3_TX_LEN = 0;
  USBHSD->UEP3_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP3_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP4_TX_LEN = 0;
  USBHSD->UEP4_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP4_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP5_TX_LEN = 0;
  USBHSD->UEP5_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP5_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP6_TX_LEN = 0;
  USBHSD->UEP6_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP6_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP7_TX_LEN = 0;
  USBHSD->UEP7_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP7_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP8_TX_LEN = 0;
  USBHSD->UEP8_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP8_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP9_TX_LEN = 0;
  USBHSD->UEP9_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP9_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP10_TX_LEN = 0;
  USBHSD->UEP10_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP10_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP11_TX_LEN = 0;
  USBHSD->UEP11_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP11_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP12_TX_LEN = 0;
  USBHSD->UEP12_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP12_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP13_TX_LEN = 0;
  USBHSD->UEP13_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP13_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP14_TX_LEN = 0;
  USBHSD->UEP14_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP14_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;

  USBHSD->UEP15_TX_LEN = 0;
  USBHSD->UEP15_TX_CTRL = USBHS_EP_T_AUTOTOG | USBHS_EP_T_RES_NAK;
  USBHSD->UEP15_RX_CTRL = USBHS_EP_R_AUTOTOG | USBHS_EP_R_RES_ACK;
}

/*********************************************************************
 * @fn      USBHS_Device_Init
 *
 * @brief   USB2.0高速设备初始化
 *
 * @return  none
 */
void USBHS_Device_Init(FunctionalState sta)
{
  if (sta)
  {
    /* 配置DMA、速度、端点使能等 */
    USBHSD->HOST_CTRL = 0x00;
    USBHSD->HOST_CTRL = USBHS_SUSPENDM;

