mcu598/6-AXIS-CH32V307-GRBL/__history/2023224222043_ch32v30x_usbhs_device.c
    USBHSD->CONTROL = 0x00;
    USBHSD->CONTROL = USBHS_DMA_EN | USBHS_INT_BUSY_EN | USBHS_HIGH_SPEED;
//        USBHSD->CONTROL   = USBHS_DMA_EN | USBHS_INT_BUSY_EN | USBHS_FULL_SPEED;
//        USBHSD->CONTROL   = USBHS_DMA_EN | USBHS_INT_BUSY_EN | USBHS_LOW_SPEED;

    USBHSD->INT_EN = 0;
    USBHSD->INT_EN = USBHS_SETUP_ACT_EN | USBHS_TRANSFER_EN
                     | USBHS_DETECT_EN | USBHS_SUSPEND_EN;

    /* ALL endpoint enable */
    USBHSD->ENDP_CONFIG = 0xffffffff;

    /* USB2.0高速设备端点初始化 */
    USBHS_Device_Endp_Init();
    Delay_Us(10);

    /* 使能USB连接 */
    USBHSD->CONTROL |= USBHS_DEV_PU_EN;
  }
  else
  {
    USBHSD->CONTROL &= ~USBHS_DEV_PU_EN;
    USBHSD->CONTROL |= USBHS_ALL_CLR | USBHS_FORCE_RST;
  }
}

/*********************************************************************
 * @fn      USBHS_Device_SetAddress
 *
 * @brief   USB2.0高速设备设置设备地址
 *
 * @return  none
 */
void USBHS_Device_SetAddress(UINT32 address)
{
  USBHSD->DEV_AD = 0;
  USBHSD->DEV_AD = address & 0xff;
}

#define MIN(a,b) ((a)<(b)?(a):(b))

/*********************************************************************
 * @fn      USBHS_IRQHandler
 *
 * @brief   This function handles USBHS exception.
 *
 * @return  none
 */
void USBHS_IRQHandler(void)
{
  UINT32 end_num;
  UINT32 rx_token;
  UINT16 len = 0x00;
  UINT16 rx_len = 0;
  UINT16 i;
  UINT8 errflag = 0x00;
  UINT8 chtype;

  USBHS_Int_Flag = USBHSD->INT_FG;

  if (USBHS_Int_Flag & USBHS_TRANSFER_FLAG)
  {
    /* 端点传输处理 */
    end_num = (USBHSD->INT_ST) & MASK_UIS_ENDP;
    rx_token = (((USBHSD->INT_ST) & MASK_UIS_TOKEN) >> 4) & 0x03;
    /* 00: OUT, 01:SOF, 10:IN, 11:SETUP */
    if (end_num == 0)
    {
      /* 端点0处理 */
      if (rx_token == PID_IN)
      {
        /* 端点0上传成功中断 */

//                printf("\r\n===== USBHS_Dev_SetupReqCode:0x%X",
//                        USBHS_Dev_SetupReqCode);
//                printf("   bRequestType:0x%X", pMySetupReqPak->bRequestType);
//                printf("   bRequest:0x%X", pMySetupReqPak->bRequest);
//                printf("   wValue:0x%X", pMySetupReqPak->wValue);
//                printf("   wIndex:%d", pMySetupReqPak->wIndex);
//                printf("   wLength:%d", pMySetupReqPak->wLength);

        switch (USBHS_Dev_SetupReqCode)
        {
          case WCID_VENDOR_CODE:

            len = USBHS_Dev_SetupReqLen >= USBHS_UEP0_SIZE ?
                  USBHS_UEP0_SIZE : USBHS_Dev_SetupReqLen;
            memcpy(EP0_Databuf, pDescr, len);
            USBHS_Dev_SetupReqLen -= len;
            pDescr += len;
            USBHS_Dev_Endp0_Tog ^= 1;
            USBHSD->UEP0_TX_LEN = len;
            USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_ACK
                                   | (USBHS_Dev_Endp0_Tog ?
                                      USBHS_EP_T_TOG_0 :
                                      USBHS_EP_T_TOG_1);

            //               printf("   len:%d", len);
            break;

          case USB_GET_DESCRIPTOR:

            len = USBHS_Dev_SetupReqLen >= USBHS_UEP0_SIZE ?
                  USBHS_UEP0_SIZE : USBHS_Dev_SetupReqLen;
            memcpy(EP0_Databuf, pDescr, len);
            USBHS_Dev_SetupReqLen -= len;
            pDescr += len;
            USBHS_Dev_Endp0_Tog ^= 1;
            USBHSD->UEP0_TX_LEN = len;
            USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_ACK
                                   | (USBHS_Dev_Endp0_Tog ?
                                      USBHS_EP_T_TOG_0 :
                                      USBHS_EP_T_TOG_1);

            break;

          case USB_SET_ADDRESS:
            USBHS_Device_SetAddress(USBHS_Dev_Address);
            USBHSD->UEP0_TX_LEN = 0;
            USBHSD->UEP0_TX_CTRL = 0;
            USBHSD->UEP0_RX_CTRL = 0;
            break;

          default:
            /* 状态阶段完成中断或者是强制上传0长度数据包结束控制传输 */
            USBHSD->UEP0_RX_CTRL =
              USBHS_EP_R_RES_ACK | USBHS_EP_R_TOG_1;
            pDescr = NULL;
            break;
        }
      }
      else if (rx_token == PID_OUT)
      {
        USBHSD->UEP0_TX_LEN = 0;
        USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_ACK | USBHS_EP_T_TOG_1;
      }
    }
    else if (end_num == 1)
    {
      if (rx_token == PID_IN)
      {

      }
      else if (rx_token == PID_OUT)
      {
//                rx_len = USBHSD->RX_LEN;
//                for( i=0; i<rx_len; i++)
//                {
//                    EP1_Tx_Databuf[i] = EP1_Rx_Databuf[i];
//                }
//                USBHSD->UEP1_TX_LEN  = rx_len;
        int ret = DAP_ProcessCommand(EP1_Rx_Databuf, EP1_Tx_Databuf);

        USBHSD->UEP1_TX_LEN = ret & 0xFFFF;
        USBHSD->UEP1_TX_CTRL &= ~USBHS_EP_T_RES_MASK;
        USBHSD->UEP1_TX_CTRL |= USBHS_EP_T_RES_ACK;
        USBHSD->UEP1_RX_CTRL &= ~ USBHS_EP_R_RES_MASK;
        USBHSD->UEP1_RX_CTRL |= USBHS_EP_R_RES_ACK;

      }
    }
    else if (end_num == 2)
    {
      if (rx_token == PID_IN)
      {

      }
      else if (rx_token == PID_OUT)
      {
        rx_len = USBHSD->RX_LEN;
        for (i = 0; i < rx_len; i++)
        {
          EP2_Tx_Databuf[i] = EP2_Rx_Databuf[i];
        }
        USBHSD->UEP2_TX_LEN = rx_len;
        USBHSD->UEP2_TX_CTRL &= ~USBHS_EP_T_RES_MASK;
        USBHSD->UEP2_TX_CTRL |= USBHS_EP_T_RES_ACK;
        USBHSD->UEP2_RX_CTRL &= ~ USBHS_EP_R_RES_MASK;
        USBHSD->UEP2_RX_CTRL |= USBHS_EP_R_RES_ACK;
      }
    }
    USBHSD->INT_FG = USBHS_TRANSFER_FLAG;
  }
  else if (USBHS_Int_Flag & USBHS_SETUP_FLAG)
  {
    /* SETUP包处理 */
    USBHS_Dev_SetupReqLen = pMySetupReqPak->wLength;
    USBHS_Dev_SetupReqCode = pMySetupReqPak->bRequest;
    chtype = pMySetupReqPak->bRequestType;
    len = 0x00;
    errflag = 0x00;

//        printf("\r\n******bRequestType:0x%X", pMySetupReqPak->bRequestType);
//        printf("   bRequest:0x%X", pMySetupReqPak->bRequest);
//        printf("   wValue:0x%X", pMySetupReqPak->wValue);
//        printf("   wIndex:%d", pMySetupReqPak->wIndex);
//        printf("   wLength:%d", pMySetupReqPak->wLength);

    /* 判断当前是标准请求还是其他请求 */
    if (( pMySetupReqPak->bRequestType & USB_REQ_TYP_MASK)
        != USB_REQ_TYP_STANDARD)
    {

      /* 其它请求,如类请求,产商请求等 */
      if ( pMySetupReqPak->bRequestType & 0x40)
      {
        /* 厂商请求 */
        switch (USBHS_Dev_SetupReqCode)
        {
          case WCID_VENDOR_CODE:

            if (pMySetupReqPak->wIndex == 4)
            {
              pDescr = WCIDDescriptor;
              len = sizeof(WCIDDescriptor);
            }
            else if (pMySetupReqPak->wIndex == 5)
            {
              pDescr = WCIDProperties;
              len = sizeof(WCIDProperties);
            }

            break;

          default:
            errflag = 0xFF; /* 操作失败 */
            break;
        }
      }
      else if ( pMySetupReqPak->bRequestType & 0x20)
      {
        /* 类请求 */
      }

