mcu598/6-AXIS-CH32V307-GRBL/__history/2023224222043_ch32v30x_usbhs_device.c
      /* 判断是否可以正常处理 */
      if (errflag != 0xFF)
      {
        if (USBHS_Dev_SetupReqLen > len)
        {
          USBHS_Dev_SetupReqLen = len;
        }
        len = (USBHS_Dev_SetupReqLen >= USBHS_UEP0_SIZE) ?
              USBHS_UEP0_SIZE : USBHS_Dev_SetupReqLen;
        memcpy(EP0_Databuf, pDescr, len);
        pDescr += len;
      }
    }
    else
    {
      /* 处理标准USB请求包 */
      switch (USBHS_Dev_SetupReqCode)
      {
        case USB_GET_DESCRIPTOR:
        {
          switch ((( pMySetupReqPak->wValue) >> 8))
          {
            case USB_DESCR_TYP_DEVICE:
              /* 获取设备描述符 */
              pDescr = MyDevDescr;
              len = MyDevDescr[0];
              break;

            case USB_DESCR_TYP_CONFIG:
              /* 获取配置描述符 */
              pDescr = MyCfgDescr_HS;
              len = MyCfgDescr_HS[2] | ((UINT16) MyCfgDescr_HS[3] << 8);
              break;

            case USB_DESCR_TYP_STRING:
              /* 获取字符串描述符 */
              switch (( pMySetupReqPak->wValue) & 0xff)
              {
                case 0:
                  /* 语言字符串描述符 */
                  pDescr = MyLangDescr;
                  len = MyLangDescr[0];
                  break;

                case 1:
                  /* USB产商字符串描述符 */
                  pDescr = MyManuInfo;
                  len = sizeof(MyManuInfo);
                  break;

                case 2:
                  /* USB产品字符串描述符 */
                  pDescr = MyProdInfo;
                  len = sizeof(MyProdInfo);
                  break;

                case 3:
                  /* USB序列号字符串描述符 */
                  pDescr = MySerNumInfo;
                  len = sizeof(MySerNumInfo);
                  break;
                case 4:
                  /* USB序列号字符串描述符 */
                  pDescr = MyInterfInfo;
                  len = sizeof(MyInterfInfo);
                  break;

                case 0xee:
                  pDescr = WCID_StringDescriptor_MSOS;
                  len = sizeof(WCID_StringDescriptor_MSOS);
                  break;

                default:
                  errflag = 0xFF;
                  break;
              }
              break;

            case USB_DESCR_TYP_QUALIF:
              /* 设备限定描述符 */
              pDescr = (PUINT8) &MyUSBQUADesc[0];
              len = sizeof(MyUSBQUADesc);
              break;

            case USB_DESCR_TYP_SPEED:
              /* 其他速度配置描述符 */
              if (USBHS_Dev_Speed == 0x01)
              {
                /* 高速模式 */
                memcpy(&TAB_USB_HS_OSC_DESC[2], &MyCfgDescr_FS[2],
                       sizeof(MyCfgDescr_FS) - 2);
                pDescr = (PUINT8) &TAB_USB_HS_OSC_DESC[0];
                len = sizeof(TAB_USB_HS_OSC_DESC);
              }
              else if (USBHS_Dev_Speed == 0x00)
              {
                /* 全速模式 */
                memcpy(&TAB_USB_FS_OSC_DESC[2], &MyCfgDescr_HS[2],
                       sizeof(MyCfgDescr_HS) - 2);
                pDescr = (PUINT8) &TAB_USB_FS_OSC_DESC[0];
                len = sizeof(TAB_USB_FS_OSC_DESC);
              }
              else
              {
                errflag = 0xFF;
              }
              break;

            case USB_DESCR_TYP_BOS:
              /* BOS描述符 */
              /* USB2.0设备不支持BOS描述符 */

              pDescr = MyBOSDesc;
              len = sizeof(MyBOSDesc);
              //errflag = 0xFF;
              break;
            default:
              errflag = 0xFF;
              break;
          }

          /* 判断是否可以正常处理 */
          if (errflag != 0xFF)
          {
            if (USBHS_Dev_SetupReqLen > len)
            {
              USBHS_Dev_SetupReqLen = len;
            }
            len = (USBHS_Dev_SetupReqLen >= USBHS_UEP0_SIZE) ?
                  USBHS_UEP0_SIZE : USBHS_Dev_SetupReqLen;
            memcpy(EP0_Databuf, pDescr, len);
            pDescr += len;
          }
        }
        break;

        case USB_SET_ADDRESS:
          /* 设置地址 */
          USBHS_Dev_Address = ( pMySetupReqPak->wValue) & 0xff;
          break;

        case USB_GET_CONFIGURATION:
          /* 获取配置值 */
          EP0_Databuf[0] = USBHS_Dev_Config;
          if (USBHS_Dev_SetupReqLen > 1)
          {
            USBHS_Dev_SetupReqLen = 1;
          }
          break;

        case USB_SET_CONFIGURATION:
          /* 设置配置值 */
          USBHS_Dev_Config = ( pMySetupReqPak->wValue) & 0xff;
          USBHS_Dev_EnumStatus = 0x01;
          break;

        case USB_CLEAR_FEATURE:
          /* 清除特性 */
          if (( pMySetupReqPak->bRequestType & USB_REQ_RECIP_MASK)
              == USB_REQ_RECIP_ENDP)
          {
            /* 清除端点 */
            switch (( pMySetupReqPak->wIndex) & 0xff)   /* wIndexL */
            {
              case 0x82:
                /* SET Endp2 Tx to USBHS_EP_T_RES_NAK;USBHS_EP_T_TOG_0;len = 0 */
                USBHSD->UEP2_TX_LEN = 0;
                USBHSD->UEP2_TX_CTRL = USBHS_EP_T_RES_NAK
                                       | USBHS_EP_T_TOG_0;
                break;

              case 0x02:
                /* SET Endp2 Rx to USBHS_EP_R_RES_ACK;USBHS_EP_R_TOG_0 */
                USBHSD->UEP2_TX_CTRL = USBHS_EP_R_RES_ACK
                                       | USBHS_EP_R_TOG_0;
                break;

              case 0x81:
                /* SET Endp1 Tx to USBHS_EP_T_RES_NAK;USBHS_EP_T_TOG_0;len = 0 */
                USBHSD->UEP1_TX_LEN = 0;
                USBHSD->UEP1_TX_CTRL = USBHS_EP_T_RES_NAK
                                       | USBHS_EP_T_TOG_0;
                break;

              case 0x01:
                /* SET Endp1 Rx to USBHS_EP_R_RES_NAK;USBHS_EP_R_TOG_0 */
                USBHSD->UEP1_RX_CTRL = USBHS_EP_R_RES_ACK
                                       | USBHS_EP_R_TOG_0;
                break;

              default:
                errflag = 0xFF;
                break;
            }
          }
          else if (( pMySetupReqPak->bRequestType & USB_REQ_RECIP_MASK)
                   == USB_REQ_RECIP_DEVICE)
          {
            if ((( pMySetupReqPak->wValue) & 0xff) == 1)   /* wIndexL */
            {
              USBHS_Dev_SleepStatus &= ~0x01;
            }
          }
          else
          {
            errflag = 0xFF;
          }
          break;

        case USB_SET_FEATURE:
          /* 设置特性 */
          if (( pMySetupReqPak->bRequestType & 0x1F) == 0x00)
          {
            /* 设置设备 */
            if ( pMySetupReqPak->wValue == 0x01)
            {
              if (MyCfgDescr_HS[7] & 0x20)
              {
                /* 设置唤醒使能标志 */
                USBHS_Dev_SleepStatus = 0x01;
              }
              else
              {
                errflag = 0xFF;
              }
            }
            else
            {
              errflag = 0xFF;
            }
          }
          else if (( pMySetupReqPak->bRequestType & 0x1F) == 0x02)
          {
            /* 设置端点 */
            if ( pMySetupReqPak->wValue == 0x00)
            {
              /* 设置指定端点STALL */
              switch (( pMySetupReqPak->wIndex) & 0xff)
              {
                case 0x82:
                  /* 设置端点2 IN STALL */
                  USBHSD->UEP2_TX_CTRL = ( USBHSD->UEP2_TX_CTRL
                                           & ~USBHS_EP_T_RES_MASK)
                                         | USBHS_EP_T_RES_STALL;
                  break;

                case 0x02:
                  /* 设置端点2 OUT Stall */
                  USBHSD->UEP2_RX_CTRL = ( USBHSD->UEP2_RX_CTRL
                                           & ~USBHS_EP_R_RES_MASK)
                                         | USBHS_EP_R_RES_STALL;
                  break;

