mcu598/6-AXIS-CH32V307-GRBL/__history/2023224222043_ch32v30x_usbhs_device.c
                case 0x81:
                  /* 设置端点1 IN STALL */
                  USBHSD->UEP1_TX_CTRL = ( USBHSD->UEP1_TX_CTRL
                                           & ~USBHS_EP_T_RES_MASK)
                                         | USBHS_EP_T_RES_STALL;
                  break;

                case 0x01:
                  /* 设置端点1 OUT STALL */
                  USBHSD->UEP1_RX_CTRL = ( USBHSD->UEP1_RX_CTRL
                                           & ~USBHS_EP_R_RES_MASK)
                                         | USBHS_EP_R_RES_STALL;
                  break;

                default:
                  errflag = 0xFF;
                  break;
              }
            }
            else
            {
              errflag = 0xFF;
            }
          }
          else
          {
            errflag = 0xFF;
          }
          break;

        case USB_GET_INTERFACE:
          EP0_Databuf[0] = 0x00;
          if (USBHS_Dev_SetupReqLen > 1)
          {
            USBHS_Dev_SetupReqLen = 1;
          }
          break;

        case USB_SET_INTERFACE:
          EP0_Databuf[0] = 0x00;
          if (USBHS_Dev_SetupReqLen > 1)
          {
            USBHS_Dev_SetupReqLen = 1;
          }
          break;

        case USB_GET_STATUS:
          /* 根据当前端点实际状态进行应答 */
          EP0_Databuf[0] = 0x00;
          EP0_Databuf[1] = 0x00;
          if ( pMySetupReqPak->wIndex == 0x81)
          {
            if (( USBHSD->UEP1_TX_CTRL & USBHS_EP_T_RES_MASK)
                == USBHS_EP_T_RES_STALL)
            {
              EP0_Databuf[0] = 0x01;
            }
          }
          else if ( pMySetupReqPak->wIndex == 0x01)
          {
            if (( USBHSD->UEP1_RX_CTRL & USBHS_EP_R_RES_MASK)
                == USBHS_EP_R_RES_STALL)
            {
              EP0_Databuf[0] = 0x01;
            }
          }
          else if ( pMySetupReqPak->wIndex == 0x82)
          {
            if (( USBHSD->UEP2_TX_CTRL & USBHS_EP_T_RES_MASK)
                == USBHS_EP_T_RES_STALL)
            {
              EP0_Databuf[0] = 0x01;
            }
          }
          else if ( pMySetupReqPak->wIndex == 0x02)
          {
            if (( USBHSD->UEP2_RX_CTRL & USBHS_EP_R_RES_MASK)
                == USBHS_EP_R_RES_STALL)
            {
              EP0_Databuf[0] = 0x01;
            }
          }
          if (USBHS_Dev_SetupReqLen > 2)
          {
            USBHS_Dev_SetupReqLen = 2;
          }
          break;

        default:
          errflag = 0xff;
          break;
      }
    }

    /* 端点0处理 */
    if (errflag == 0xFF)
    {
      /* IN - STALL / OUT - DATA - STALL */
      USBHS_Dev_SetupReqCode = 0xFF;
      USBHSD->UEP0_TX_LEN = 0;
      USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_STALL;
      USBHSD->UEP0_RX_CTRL = USBHS_EP_R_RES_STALL;
    }
    else
    {
      /* DATA stage (IN -DATA1-ACK) */
      if (chtype & 0x80)
      {
        len = (USBHS_Dev_SetupReqLen > USBHS_UEP0_SIZE) ?
              USBHS_UEP0_SIZE : USBHS_Dev_SetupReqLen;
        USBHS_Dev_SetupReqLen -= len;
      }
      else
      {
        len = 0;
      }

      //          printf("   len2:%d", len);
      USBHSD->UEP0_TX_LEN = len;
      USBHSD->UEP0_TX_CTRL = USBHS_EP_T_RES_ACK | USBHS_EP_T_TOG_1;
    }
    USBHSD->INT_FG = USBHS_SETUP_FLAG;
  }
  else if (USBHS_Int_Flag & USBHS_DETECT_FLAG)
  {
    /* USB总线复位中断 */
#if 0
    printf("\r\nUSB ReSet!!! USBHS_Dev_Address=%d", USBHS_Dev_Address);
#endif
    USBHS_Dev_Address = 0x00;
    USBHS_Device_Endp_Init(); /* USB2.0高速设备端点初始化 */
    USBHS_Device_SetAddress(USBHS_Dev_Address); /* USB2.0高速设备设置设备地址 */
    USBHSD->INT_FG = USBHS_DETECT_FLAG;
  }
  else if (USBHS_Int_Flag & USBHS_SUSPEND_FLAG)
  {
    /* USB总线挂起/唤醒完成中断 */
    /* 唤醒 */
#if 0
    printf("\r\nUSB SUSPEND!!!");

#endif
    USBHS_Dev_SleepStatus &= ~0x02;
    USBHS_Dev_EnumStatus = 0x01;
    USBHSD->INT_FG = USBHS_SUSPEND_FLAG;
  }
}

